In [5]:
import pandas as pd

In [16]:
df = pd.read_csv('Customers.csv')

In [17]:
df.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [23]:
df.describe()

,CustomerID,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
count,49.00000,49.000000,49.000000,49.000000,49.000000,49.000000
mean,25.00000,35.367347,53734.693878,49.632653,3.224490,2.959184
std,14.28869,13.879982,29341.932104,30.511401,3.954245,1.657800
min,1.00000,18.000000,3000.000000,3.000000,0.000000,1.000000
25%,13.00000,23.000000,29000.000000,26.000000,1.000000,2.000000
50%,25.00000,31.000000,59000.000000,47.000000,1.000000,3.000000
75%,37.00000,46.000000,78000.000000,76.000000,5.000000,4.000000
max,49.00000,67.000000,98000.000000,99.000000,14.000000,8.000000

In [24]:
df.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income ($)          int64
Spending Score (1-100)     int64
Profession                object
Work Experience            int64
Family Size                int64
dtype: object

In [25]:
df.isnull().any()

CustomerID                False
Gender                    False
Age                       False
Annual Income ($)         False
Spending Score (1-100)    False
Profession                False
Work Experience           False
Family Size               False
dtype: bool

In [21]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income ($)         0
Spending Score (1-100)    0
Profession                0
Work Experience           0
Family Size               0
dtype: int64

In [22]:
df_filled=df.fillna(0)

In [26]:
df=df.rename(columns={'CustomerID':'ID'})
df.head()

,ID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [28]:
df['Value_new']=df['Family Size'].astype(float)
df.head()

,ID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size,Value_new
0,1,Male,19,15000,39,Healthcare,1,4,4.0
1,2,Male,21,35000,81,Engineer,3,3,3.0
2,3,Female,20,86000,6,Engineer,1,1,1.0
3,4,Female,23,59000,77,Lawyer,0,2,2.0
4,5,Female,31,38000,40,Entertainment,2,6,6.0

In [29]:
df['new_value']=df['Family Size'].apply(lambda x:x*2)
df.head()

,ID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size,Value_new,new_value
0,1,Male,19,15000,39,Healthcare,1,4,4.0,8
1,2,Male,21,35000,81,Engineer,3,3,3.0,6
2,3,Female,20,86000,6,Engineer,1,1,1.0,2
3,4,Female,23,59000,77,Lawyer,0,2,2.0,4
4,5,Female,31,38000,40,Entertainment,2,6,6.0,12

In [33]:
grouped_mean=df.groupby('Spending Score (1-100)')['Family Size'].mean()
print(grouped_mean)

Spending Score (1-100)
3     3.000000
4     3.000000
5     2.000000
6     2.000000
13    1.000000
14    2.666667
15    5.000000
17    1.000000
26    2.000000
28    1.000000
29    4.000000
31    1.000000
32    8.000000
35    2.333333
36    3.000000
39    4.000000
40    6.000000
42    4.000000
47    1.000000
55    4.000000
61    2.500000
65    2.000000
66    6.000000
72    4.000000
73    3.250000
75    2.000000
76    2.000000
77    1.500000
79    2.000000
81    3.500000
82    3.000000
87    4.000000
92    4.500000
94    3.000000
98    1.000000
99    4.000000
Name: Family Size, dtype: float64

In [34]:
df1=pd.DataFrame({'key':['A','B','C'],'value1':[1,2,3]})
df2=pd.DataFrame({'key':['A','B','D'],'value2':[4,5,6]})

In [35]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [36]:
df2

  key  value2
0   A       4
1   B       5
2   D       6

In [37]:
pd.merge(df1,df2,on="key",how="inner")

  key  value1  value2
0   A       1       4
1   B       2       5

In [38]:
pd.merge(df1,df2,on="key",how="outer")

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0